БухЭксп/InformationRegisters/CW_ДоступныеСправочникиПоГруппамПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДоступныеСправочникиПоГруппамПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГруппаПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъектаМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляПараметровМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ПраваДоступа/Ext/Module.bsl
// Получает значение реквизита элемента справочника "ГруппыПользователей",
// установленного для пользователя в качестве группы. Если для
// пользователя группа не определена, то возвращается "Ложь".
Функция ПравоДоступно(ИмяПрава,Пользователь=Неопределено) Экспорт 
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ЭтоПолноправныйПользователь(Пользователь,Истина) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если НЕ ПроверитьГруппу(ГруппаПользователя) Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы ИЛИ 
		 ГруппаПользователя.ПолныеПрава 
	Тогда
		Возврат Истина;
	Иначе
		
		// если в группе пользователя предусмотрена опция доступа к данному справочнику,
		// то возвращаем его значение, иначе считаем, что такое право дано на уровне 
		// прав методанных конфигурации
		Попытка
			Возврат(ГруппаПользователя[ИмяПрава]);	
		Исключение
			Возврат Истина;			
		КонецПопытки;
	КонецЕсли; 
КонецФункции

// Проверяет, является ли текущий или указанный пользователь полноправным.
// 
// Полноправным считается пользователь, который
// а) при не пустом списке пользователей информационной базы, 
//    имеет роль ПолныеПрава и роль для администрирования системы (если ПроверятьПраваАдминистрированияСистемы = Истина)
// б) при пустом списке пользователей информационной базы
//    основная роль конфигурации не задана или ПолныеПрава.
//
// Параметры:
//  Пользователь - Неопределено - проверяется текущий пользователь ИБ.
//               - СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи - осуществляется
//                    поиск пользователя ИБ по уникальному идентификатору, заданному в реквизите.
//                    ИдентификаторПользователяИБ. Если пользователь ИБ не найден, возвращается Ложь.
//               - ПользовательИнформационнойБазы - проверяется указанный пользователь ИБ.
//
//  ПроверятьПраваАдминистрированияСистемы - Булево - если задано Истина, тогда проверяется наличие
//                 роли для администрирования системы.
//
//  УчитыватьПривилегированныйРежим - Булево - если задано Истина, тогда для текущего пользователя
//                 функция возвращает Истина, когда установлен привилегированный режим.
//
// Возвращаемое значение:
//  Булево - если Истина, пользователь является полноправным.
//
// Проверяет, является ли текущий или указанный пользователь полноправным.
// 
// Полноправным считается пользователь, который
// а) при не пустом списке пользователей информационной базы, 
//    имеет роль ПолныеПрава и роль для администрирования системы (если ПроверятьПраваАдминистрированияСистемы = Истина)
// б) при пустом списке пользователей информационной базы
//    основная роль конфигурации не задана или ПолныеПрава.
//
// Параметры:
//  Пользователь - Неопределено - проверяется текущий пользователь ИБ.
//               - СправочникСсылка.Пользователи, СправочникСсылка.ВнешниеПользователи - осуществляется
//                    поиск пользователя ИБ по уникальному идентификатору, заданному в реквизите.
//                    ИдентификаторПользователяИБ. Если пользователь ИБ не найден, возвращается Ложь.
//               - ПользовательИнформационнойБазы - проверяется указанный пользователь ИБ.
//
//  ПроверятьПраваАдминистрированияСистемы - Булево - если задано Истина, тогда проверяется наличие
//                 роли для администрирования системы.
//
//  УчитыватьПривилегированныйРежим - Булево - если задано Истина, тогда для текущего пользователя
//                 функция возвращает Истина, когда установлен привилегированный режим.
//
// Возвращаемое значение:
//  Булево - если Истина, пользователь является полноправным.
//
Функция ЭтоПолноправныйПользователь(Пользователь = Неопределено,
                                    ПроверятьПраваАдминистрированияСистемы = Ложь) Экспорт
	
	СвойстваПользователяИБ = СвойстваПроверяемогоПользователяИБ(Пользователь);
	
	Если СвойстваПользователяИБ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверитьРольПолныеПрава 			= Не ПроверятьПраваАдминистрированияСистемы;
	ПроверитьРольАдминистратораСистемы 	= ПроверятьПраваАдминистрированияСистемы;
	
	Если Не СвойстваПользователяИБ.УказанТекущийПользовательИБ Тогда
		Роли = СвойстваПользователяИБ.ПользовательИБ.Роли;
		
		// Для не текущего пользователя ИБ проверяются роли в записанном пользователе ИБ.
		Если ПроверитьРольПолныеПрава
		   И Не Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ПроверитьРольАдминистратораСистемы
		   И Не Роли.Содержит(Метаданные.Роли.АдминистраторСистемы) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	// Для текущего пользователя ИБ проверяются роли не в записанном пользователе ИБ,
	// а роли в текущем сеансе.
	Если ПроверитьРольПолныеПрава
	   И Не СвойстваПользователяИБ.РольДоступнаПолныеПрава Тогда // Не заменять на РолиДоступны.
		Возврат Ложь;
	КонецЕсли;
	
	Если ПроверитьРольАдминистратораСистемы
	   И Не СвойстваПользователяИБ.РольДоступнаАдминистраторСистемы Тогда // Не заменять на РолиДоступны.
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СвойстваПроверяемогоПользователяИБ(Пользователь)
	
	СвойстваТекущегоПользовательИБ = ПользователиСлужебныйПовтИсп.СвойстваТекущегоПользователяИБ();
	ПользовательИБ = Неопределено;
	
	Если ТипЗнч(Пользователь) = Тип("ПользовательИнформационнойБазы") Тогда
		ПользовательИБ = Пользователь;
		
	ИначеЕсли Пользователь = Неопределено Или Пользователь = Пользователи.АвторизованныйПользователь() Тогда
		Возврат СвойстваТекущегоПользовательИБ;
	Иначе
		// Задан не текущий пользователь.
		Если ЗначениеЗаполнено(Пользователь) Тогда
			ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
			Если СвойстваТекущегоПользовательИБ.УникальныйИдентификатор = ИдентификаторПользователяИБ Тогда
				Возврат СвойстваТекущегоПользовательИБ;
			КонецЕсли;
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		КонецЕсли;
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если СвойстваТекущегоПользовательИБ.УникальныйИдентификатор = ПользовательИБ.УникальныйИдентификатор Тогда
		Возврат СвойстваТекущегоПользовательИБ;
	КонецЕсли;
	
	Свойства = Новый Структура;
	Свойства.Вставить("УказанТекущийПользовательИБ", Ложь);
	Свойства.Вставить("ПользовательИБ", ПользовательИБ);
	
	Возврат Свойства;
	
КонецФункции



Функция ДействуетОграничение(ИмяОграничения,Пользователь=Неопределено) Экспорт 
	// --- 
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;
	
	АдминистраторСистемы = ЭтоПолноправныйПользователь(Пользователь,Истина);
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если НЕ ПроверитьГруппу(ГруппаПользователя) Тогда
		
		Возврат(Истина);
		
	КонецЕсли;
	// --- 
	Если ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы ИЛИ ГруппаПользователя.ПолныеПрава или АдминистраторСистемы Тогда
		
		Возврат(Ложь);
		
	Иначе
		
		Возврат(ГруппаПользователя[ИмяОграничения]);	
		
	КонецЕсли; 

	
	// --- 
КонецФункции

Функция НаборПрав(Пользователь=Неопределено) Экспорт 
	// --- 
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли; 
	
	АдминистраторСистемы = ЭтоПолноправныйПользователь(Пользователь,Истина);

	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	ОшибкаПроверкиГруппы = Ложь;
	Если НЕ ПроверитьГруппу(ГруппаПользователя) Тогда
		
		ОшибкаПроверкиГруппы = Истина;
		
	КонецЕсли; 
	флПолныеПрава = ( ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы ИЛИ ГруппаПользователя.ПолныеПрава или АдминистраторСистемы);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей
	|ГДЕ
	|	CW_ГруппыПользователей.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ?(флПолныеПрава ИЛИ ОшибкаПроверкиГруппы,Справочники.CW_ГруппыПользователей.Администраторы,ГруппаПользователя));
	ТЗ = Запрос.Выполнить().Выгрузить();
	// ---                                    ""
	
	СтруктураПрав = _сф.ст_СоздатьИзТаблицы(ТЗ);
	_сф.ст_УдалитьСвойства(СтруктураПрав,"Ссылка,Наименование,Код,ВерсияДанных,Предопределенный,ПометкаУдаления,ПолныеПрава,Комментарий");
	_сф.ст_ЗаполнитьПоСтрокеТаблицы(СтруктураПрав,_сф.к_ПервыйЭлемент(ТЗ));
	
	Если ОшибкаПроверкиГруппы Тогда
		
		Для каждого КЗ Из СтруктураПрав Цикл
			
			СтруктураПрав[КЗ.Ключ] = Ложь;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Если флПолныеПрава Тогда
		
		Для каждого КЗ Из СтруктураПрав Цикл
			
			СтруктураПрав[КЗ.Ключ] = Истина;
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат(СтруктураПрав);
	
	// --- 
КонецФункции

Функция ПроверитьГруппу(ГруппаПользователя)
	// --- 
	
	Если ГруппаПользователя = Неопределено Тогда
		
		Возврат(Ложь);
		
	Иначе
		
		Если ГруппаПользователя.Пустая() Тогда
			
			Возврат(Ложь);
			
		КонецЕсли; 
		
	КонецЕсли; 

	// --- 
	
	Возврат(Истина);
	
	// --- 
КонецФункции

// --- 

Функция НаборПравДляПараметров(Пользователь=Неопределено) Экспорт 
	// --- 
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли; 

	АдминистраторСистемы = ЭтоПолноправныйПользователь(Пользователь,Истина);
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если (ГруппаПользователя = Неопределено) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.ПустаяСсылка();
	КонецЕсли; 
	Если (ГруппаПользователя.ПолныеПрава) или АдминистраторСистемы Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	Возврат(CW_ПраваДоступа_ПИ.ПраваПараметровДляГруппы(ГруппаПользователя));	
	
	// --- 
КонецФункции

// --- 

Процедура УстановитьПраваДляФормы(УправляемаяФорма,Право=Неопределено) Экспорт 
	
	ТипОбъекта = _сф.стр_ПолучитьСтроку(УправляемаяФорма.ИмяФормы,".",1);
	ИмяОбъекта = _сф.стр_ПолучитьСтроку(УправляемаяФорма.ИмяФормы,".",2);
	
	РедактированиеЗапрещено = РегистрыСведений.CW_ДоступныеСправочникиПоГруппамПользователей.РедактированиеОбъектаЗапрещено(ТипОбъекта+"."+ИмяОбъекта);
	
	ФормаСписка = (Найти(УправляемаяФорма.ИмяФормы,"ФормаСписка") <> 0);
	
	Если РедактированиеЗапрещено Тогда
		
		УправляемаяФорма.ТолькоПросмотр = Истина;
		
		Если (ИмяОбъекта = "CW_Линии" И ФормаСписка) Тогда
			УправляемаяФорма.Элементы.ФормаДобавитьИзКлассификатора.Доступность = Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


Функция ДоступныОбъектыБухгалтерии() Экспорт
	// --- 
	
	Возврат(РольДоступна("ДобавлениеИзменениеДанныхБухгалтерии") ИЛИ РольДоступна("ПолныеПрава"));
	
	// --- 
КонецФункции
  

//Процедура ПроверитьУстановитьРолиПользователейДляДоступаКПодсистемаБухгалтерияЭкспедитора(ТекущийПользователь)
//
//	Проверяет у текущего пользователя наличие роли "БухгалтерияЭкспдитора" и "БухгалтерияЭкспедитораМенеджер",
//  при их отсутствии и наличии пользователя в группах пользователе БЭ устанавилвает их,
//	за исключением администратораСистемы
//
Функция ПроверитьУстановитьРолиПользователейДляДоступаКПодсистемаБухгалтерияЭкспедитора() Экспорт
	
	НаборРолейИзменен 	= Ложь;
 	мДобавляемыеРоли 	= Новый Массив;
	
	//наборы ролей
	РольАдминистраторСистемы 				= Метаданные.Роли.АдминистраторСистемы;
	РольБухгалтерияЭкспедитораАдминистратор = Метаданные.Роли.БухгалтерияЭкспедитораАдминистратор;
	РольБухгалтерияЭкспедитора 				= Метаданные.Роли.БухгалтерияЭкспедитора;
	РольБухгалтерияЭкспедитораМенеджер 		= Метаданные.Роли.БухгалтерияЭкспедитораМенеджер;
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыПользователей.Пользователь КАК Пользователь,
	               |	CW_ПараметрыПользователей.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	               |	CW_ПараметрыПользователей.Группа КАК Группа
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыПользователей КАК CW_ПараметрыПользователей
	               |ГДЕ
	               |	НЕ CW_ПараметрыПользователей.Пользователь.ПометкаУдаления
	               |	И НЕ CW_ПараметрыПользователей.Пользователь.Недействителен";
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// если по каким-то причинам в регистре есть записи с незаполненным пользователем,
		// пропускаем такие записи
		Если Не ЗначениеЗаполнено(Выборка.Пользователь) Тогда
			Продолжить;
		КонецЕсли;
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторПользователяИБ);
		
		Если ПользовательИБ = Неопределено Тогда
			//По каким-то причинам пользовавтеля в базе не нашли
			Продолжить;
		КонецЕсли;
		
		Если ПользовательИБ.Роли.Содержит(РольАдминистраторСистемы) Тогда
			//Пропускаем админитраторов системы, у них полные права, 
			//даже если включены в группу администраторы
			Продолжить;			
		КонецЕсли;

		ГруппаПользователя = Выборка.Группа;

		Если Не ПользовательИБ.Роли.Содержит(РольБухгалтерияЭкспедитора) Тогда
			//Для контроля лицензий
			Если мДобавляемыеРоли.Найти(РольБухгалтерияЭкспедитора) = Неопределено Тогда
				мДобавляемыеРоли.Добавить(РольБухгалтерияЭкспедитора);
			КонецЕсли;
		КонецЕсли;
	
		Если ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы Тогда
			
			Если Не ПользовательИБ.Роли.Содержит(РольБухгалтерияЭкспедитораАдминистратор) Тогда
				мДобавляемыеРоли.Добавить(РольБухгалтерияЭкспедитораАдминистратор);
			КонецЕсли;
			
		ИначеЕсли Не ПользовательИБ.Роли.Содержит(РольБухгалтерияЭкспедитораМенеджер) Тогда
			
			Если мДобавляемыеРоли.Найти(РольБухгалтерияЭкспедитораМенеджер) = Неопределено Тогда
				мДобавляемыеРоли.Добавить(РольБухгалтерияЭкспедитораМенеджер);
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого ТекущаяРоль из мДобавляемыеРоли Цикл
			ПользовательИБ.Роли.Добавить(ТекущаяРоль);
			НаборРолейИзменен = Истина;
		КонецЦикла;
		
		Если НаборРолейИзменен Тогда
			ПользовательИБ.Записать();
		КонецЕсли;
		
	КонецЦикла;

	Возврат НаборРолейИзменен;
	
КонецФункции

Функция ПолучитьПраваНаПараметрыДляГруппыПользовтея(МассивПараметров = Неопределено, Пользователь = Неопределено) Экспорт 
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если (ГруппаПользователя = Неопределено) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.ПустаяСсылка();
	КонецЕсли; 
	Если (ГруппаПользователя.ПолныеПрава) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	               |	ВЫБОР
	               |		КОГДА CW_ПараметрыГрузоперевозок.НеПоказыватьВФормеГрузоперевозок
	               |			ТОГДА &ЭтоПолноправныйПользователь
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ПолныеПрава
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Просмотр,
	               |	ВЫБОР
	               |		КОГДА CW_ПараметрыГрузоперевозок.НеПоказыватьВФормеГрузоперевозок
	               |			ТОГДА &ЭтоПолноправныйПользователь
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА &ПолныеПрава
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Редактирование, ЛОЖЬ)
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Редактирование
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |		ПО (CW_ПраваДоступаДляПараметровМониторинга.Параметр = CW_ПараметрыГрузоперевозок.Ссылка)
	               |			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа)
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ
				   |	//УсловиеПоПараметрам";
	
	
	Если МассивПараметров <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПоПараметрам", "И CW_ПараметрыГрузоперевозок.Ссылка В(&МассивПараметров)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивПараметров", 				МассивПараметров);
	Запрос.УстановитьПараметр("Группа", 						ГруппаПользователя);
	Запрос.УстановитьПараметр("ПолныеПрава", 					ГруппаПользователя.ПолныеПрава);
	Запрос.УстановитьПараметр("ЭтоПолноправныйПользователь", 	ЭтоПолноправныйПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураПравПараметра = Новый Структура("Просмотр,Редактирование",Ложь,Ложь); 
		ЗаполнитьЗначенияСвойств(СтруктураПравПараметра,Выборка);
		
		Результат.Вставить(Выборка.Параметр, СтруктураПравПараметра);
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоступныеПараметрыДляГруппыПользователя(Пользователь = Неопределено) Экспорт 
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);
	
	Если ЭтоПолноправныйПользователь Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(Пользователь);
	Если (ГруппаПользователя = Неопределено) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.ПустаяСсылка();
	КонецЕсли; 
	Если (ГруппаПользователя.ПолныеПрава) Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 

	Если ГруппаПользователя.ПолныеПрава Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПраваДоступаДляПараметровМониторинга.Параметр КАК Параметр
	               |ИЗ
	               |	РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |ГДЕ
	               |	CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа
	               |	И CW_ПраваДоступаДляПараметровМониторинга.Просмотр = ИСТИНА";
	
	Запрос.УстановитьПараметр("Группа", ГруппаПользователя);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Результат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Параметр);
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции
